tsung/old_tests/deposit_and_buy_flow.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" []>
<tsung loglevel="notice">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='5000'/>
  </clients>
  <servers>
    <server host="BeepBoopSquad.eba-dzbukdri.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>
  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="25" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="50" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="10" unit="second">
      <users arrivalrate="100" unit="second" />
    </arrivalphase>
  </load>
  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"/>
  </options>
  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <setdynvars sourcetype="erlang" callback="ts_user_server:get_unique_id">
        <var name="username"/>
      </setdynvars>
      <transaction name="signup">
        <request subst="true">
          <http url="/users"
                method="POST"
                content_type="application/json"
                contents="{&quot;name&quot;: &quot;%%_username%%&quot;, &quot;password&quot;: &quot;password&quot;, &quot;cash_balance&quot;: 10000.0}"
          />
        </request>
      </transaction>
      <thinktime value="2" random="true"/>
      <transaction name="login">
        <request subst="true">
          <http url="/sessions"
                method="POST"
                content_type="application/json"
                contents="{&quot;name&quot;: &quot;%%_username%%&quot;, &quot;password&quot;: &quot;password&quot;}"
          />
        </request>
      </transaction>
      <thinktime value="2" random="true"/>
      <transaction name="Deposit">
        <request>
          <http url="/exchanges"
                method="POST"
                content_type="application/json"
                contents_from_file="./json/exchange_body.json"
          />
        </request>
      </transaction>
      <transaction name="Viewstockslist">
        <request>
          <http url="/stocks"
                method="GET"
                content_type='application/json'
          />
        </request>
      </transaction>
      <thinktime value="2" random="true"/>
      <transaction name="Buystock">
        <request>
          <http url="/transactions"
                method="POST"
                content_type='application/json'
                contents_from_file="./json/transaction_body.json"
          />
        </request>
      </transaction>
      <thinktime value="2" random="true"/>
      <transaction name="Logout">
        <request>
          <http url="/logout"
                method="GET"
                content_type="application/json"
          />
        </request>
      </transaction>
    </session>
  </sessions>

</tsung>