tsung/old_tests/load_test_server.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.7.0/share/tsung/tsung-1.0.dtd" [
        <!ENTITY login_post_session SYSTEM "tsung_recorder20180717.xml">
        ]>
<tsung loglevel="notice">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='1000'/>
  </clients>
  <servers>
    <server host="BeepBoopSquad.eba-dzbukdri.us-west-2.elasticbeanstalk.com" port="3000" type="tcp"></server>
  </servers>
  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
<!--    <arrivalphase phase="2" duration="1" unit="minute">-->
<!--      <users interarrival="2" unit="second"></users>-->
<!--    </arrivalphase>-->
  </load>
  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
  </options>
  <sessions>
    <session name="http-example" probability="100" type="ts_http">
<!--      <thinktime value="2" random="true"></thinktime>-->
      <request>
        <http url="/transactions"
              method="POST"
              content_type='application/json'
              contents_from_file="./transaction_body.json"
        />
<!--        <http url='/transactions' version='1.1' method='POST'-->
<!--              contents="user_id=1&amp;stock_id=1&amp;num_shares=3&amp;transaction_type=sell"></http>-->
      </request>
    </session>
  </sessions>

</tsung>